In [1]:
import time
import pandas as pd
import seaborn as sns
import sqlalchemy as sa
import logging
from df_to_sql.utils import df_to_sql

logging.getLogger().setLevel(logging.DEBUG)

In [2]:
#  Create a Postgres database in a Docker container.
!docker stop postgres
!docker container rm postgres
!docker run -p 5432:5432 --name postgres -e POSTGRES_PASSWORD=PASSWORD -d postgres

#  Create a SQLite database on disk.
if 'sqlite.db' in os.listdir('.'): os.remove('./sqlite.db')
!sqlite3 ./sqlite.db ""
time.sleep(5)

postgres
postgres
ef6cfab860fbe433a10a3d3c5d686927bbc17e1dd68294ba83ad12b56fd2c0fa

In [3]:
pg_engine = sa.create_engine('postgresql://postgres:PASSWORD@localhost:5432/postgres')

df = sns.load_dataset('penguins')

df_to_sql(df=df, table_name='penguins', schema='public', engine=pg_engine)

pg_engine = sa.create_engine('postgresql://postgres:PASSWORD@localhost:5432/postgres')

df = pd.read_sql_table('penguins', con=pg_engine)

print(df.dtypes)

df

INFO:root:Begin sql import into the table named penguins.
INFO:alembic.runtime.migration:Context impl PostgresqlImpl.
INFO:alembic.runtime.migration:Will assume transactional DDL.
DEBUG:root:Create new table for the table named penguins.
DEBUG:root:Create the temporary table named fc5bf5a50fd6b440.
DEBUG:root:Insert records into the temporary table named fc5bf5a50fd6b440.
DEBUG:root:Select and insert unique records into the table named penguins.
DEBUG:root:Drop the temporary table named fc5bf5a50fd6b440.
INFO:root:End sql import procedure into the table named penguins.

species               object
island                object
bill_length_mm       float64
bill_depth_mm        float64
flipper_length_mm    float64
body_mass_g          float64
sex                   object
dtype: object

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Chinstrap,Dream,54.2,20.8,201.0,4300.0,Male
1,Chinstrap,Dream,42.5,16.7,187.0,3350.0,Female
2,Adelie,Dream,38.8,20.0,190.0,3950.0,Male
3,Adelie,Dream,36.8,18.5,193.0,3500.0,Female
4,Adelie,Dream,40.3,18.5,196.0,4350.0,Male
...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,43.4,14.4,218.0,4600.0,Female
340,Adelie,Torgersen,41.1,18.6,189.0,3325.0,Male
341,Adelie,Biscoe,37.7,18.7,180.0,3600.0,Male
342,Gentoo,Biscoe,46.5,14.8,217.0,5200.0,Female
343,Gentoo,Biscoe,46.6,14.2,210.0,4850.0,Female

In [4]:
sl_engine = sa.create_engine('sqlite:///sqlite.db')

df = sns.load_dataset('penguins')

df_to_sql(df=df, table_name='penguins', schema='main', engine=sl_engine)

sl_engine = sa.create_engine('sqlite:///sqlite.db')

df = pd.read_sql_table('penguins', con=sl_engine)

print(df.dtypes)

df

INFO:root:Begin sql import into the table named penguins.
INFO:alembic.runtime.migration:Context impl SQLiteImpl.
INFO:alembic.runtime.migration:Will assume non-transactional DDL.
DEBUG:root:Create new table for the table named penguins.
DEBUG:root:Create the temporary table named fc5bf5a50fd6b440.
DEBUG:root:Insert records into the temporary table named fc5bf5a50fd6b440.
DEBUG:root:Select and insert unique records into the table named penguins.
DEBUG:root:Drop the temporary table named fc5bf5a50fd6b440.
INFO:root:End sql import procedure into the table named penguins.

species               object
island                object
bill_length_mm       float64
bill_depth_mm        float64
flipper_length_mm    float64
body_mass_g          float64
sex                   object
dtype: object

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Biscoe,34.5,18.1,187.0,2900.0,Female
1,Adelie,Biscoe,35.0,17.9,190.0,3450.0,Female
2,Adelie,Biscoe,35.0,17.9,192.0,3725.0,Female
3,Adelie,Biscoe,35.3,18.9,187.0,3800.0,Female
4,Adelie,Biscoe,35.5,16.2,195.0,3350.0,Female
...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,53.4,15.8,219.0,5500.0,Male
340,Gentoo,Biscoe,54.3,15.7,231.0,5650.0,Male
341,Gentoo,Biscoe,55.1,16.0,230.0,5850.0,Male
342,Gentoo,Biscoe,55.9,17.0,228.0,5600.0,Male
343,Gentoo,Biscoe,59.6,17.0,230.0,6050.0,Male